Switch>en
Switch#config terminal
Enter configuration commands, one per line. End with CNTL/Z.
Switch (config) #int fa0/1
Switch (config-if) #switchport mode access
Switch (config-if) #switchport port-security
Switch (config-if) #switchport port-security mac-address sticky
Switch (config-if) #switchport port-security maximum ?
<1-132> Maximum addresses
Switch (config-if) #switchport port-security maximum
s Incomplete command.
Switch (config-if) #switchport port-security maximum ?
<1-132> Maximum addresses
Switch (config-if) #switchport port-security maximum 1

6 Invalid input detected at '^' marker.

Switch (config-if) #switchport port-security maximum 1
Switch (config-if) #switchport port-security violation ?
Security violation protect mode
Security violation restrict mode
Security violation shutdown mode
Switch (config-if) #switchport port-security violation
% Incomplete command.
Switch (config-if) #switchport port-security violation ?
Security violation protect mode
Security violation restrict mode
Security violation shutdown mode
Switch (config-if) #switchport port-security violation shutdown
Switch (config-if) #exit
Switch (config) #int fal/1
Switch (config-if) #switchport mode access
Switch (config-if) #switchport port-security
Switch (config-if) #switchport port-security mac-address sticky
Switch (config-if) #switchport port-security maximum 1

Switch (config-if) #switchport port-security violation shutdown
Switch (config-if) #exit
Switch (config) #int fa2/1
Switch (config-if) #switchport mode access
Switch (config-if) #switchport port-security
Switch (config-if) #switchport port-security mac-address sticky
Switch (config-if) #switchport port-security maximum 1
Switch (config-if) #switchport port-security violation shutdown
Switch (config-if) #exit
Switch (config) #show port-security

% Invalid input detected at '^' marker.

Switch (config) #end
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#show port-security
Secure Port MaxSecureAddr CurrentAddr SecurityViolation Security Action
(Count)

0

(Count)

1
1
1

1

Switch#show port-security int fa0/1
Port Security
Port Status
Violation Mode
Aging Time
Aging Type
SecureStatic Address Aging : Disabled
Maximum MAC Addresses
Total MAC Addresses
Configured MAC Addresses
Sticky MAC Addresses
Last Source Address:Vlan
Security Violation Count

Switch#show port-security int fa1/1
Port Security
Port Status

Fa0/1
Fa1/1
Fa2/1
Fa3/1

(Count)

1
1

0

1

1

0

Shutdown
Shutdown
Shutdown
Shutdown

: Enabled
: Secure-up
: Shutdown
: 0 mins
: Absolute

: 1

1
: 0
: 1
: 0006.2A3B.0659:1
: 0

.

: Enabled
: Secure-up
Switch#show port-security int fa2/1
Port Security
Port Status
Violation Mode
Aging Time
Aging Type
SecureStatic Address Aging
Maximum MAC Addresses
Total MAC Addresses
Configured MAC Addresses
Sticky MAC Addresses
Last Source Address:Vlan
Security Violation Count

Switch#show mac address-table
Mac Address Table

: Enabled
: Secure-up
: Shutdown
: 0 mins
: Absolute
: Disabled
: 1

: 1
: 0
: 1
: 0000.0000.0000:0
: 0

Vlan

Mac Address

Type

Ports

1
1
1

1
Switch#

0001.43c2.7512
0001.c786.8905
0006.2a3b.0659
0007.ecce.a8b9

$LINK-3-UPDOWN: Interface FastEthernet1/1, changed state to down

$LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/1, changed state to down

%LINK-5-CHANGED: Interface FastEthernet1/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/1, changed state to up

%LINK-3-UPDOWN: Interface FastEthernet1/1, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/1, changed state to down

%LINK-5-CHANGED: Interface FastEthernet1/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/1, changed state to up

%LINK-5-CHANGED: Interface FastEthernet1/1, changed state to administratively down

Switch#en
Switch#show port-security
Secure Port MaxSecureAddr CurrentAddr SecurityViolation Security Action
(Count)

1
1
1
1

1
1
1
1

0

1

0

Shutdown
Shutdown
Shutdown
Shutdown

: Enabled
: Secure-up
: Shutdown
: 0 mins
: Absolute

: 1
: 1
0
1
0006.2A3B.0659:1
0

Vlan

Mac Address

Type

Ports

0001.43c2.7512
0001.c786.8905
0006.2a3b.0659
Switch#en
Switch#config terminal
Enter configuration commands, one per line. End with CNTL/Z.
Switch (config) #int fa0/1
Switch (config-if) #shutdown

Switch (config-if) #
$LINK-5-CHANGED: Interface FastEthernet0/1, changed state to administratively down

&LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to down

Switch (config-if) #no shutdown

Switch (config-if) #
$LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up

$LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up

Switch (config-if) #end
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#show mac address-table
Mac Address Table

Vlan

Mac Address

Type

Ports

1
1
1

0001.43c2.7512
0001.c786.8905
0006.2a3b.0659

STATIC
STATIC
STATIC

Fa3/1
Fa2/1
Fa0/1